ПочтовыйМодуль/src/InformationRegisters/ЖурналИсходящихПисем/ЖурналИсходящихПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналИсходящихПисем</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тело</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассивВложений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассивПолучателей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассивСкрытыхПолучателей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОбОшибке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусПисьма</name>
    <type>
      <types>EnumRef.СтатусИсходящихПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Важность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПрочтения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДоставления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПочтовыйМодуль/src/InformationRegisters/ЖурналИсходящихПисем/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПовторнаяОтправка(Команда)
	МассивСтрок = ЭтаФорма.Элементы.Список.ВыделенныеСтроки;  
	
	 ОтправитьПисьмо(МассивСтрок);
КонецПроцедуры


&насервере
Процедура ОтправитьПисьмо(МассивСтрок)     
	
	    для каждого Мстр из МассивСтрок цикл

	     МассивВложений  = новый Массив;
		 МассивВложенийСписком = СтрЗаменить(СокрЛП(Мстр.МассивВложений),",",Символы.ПС);
		 
				Для Индекс = 1 По СтрЧислоСтрок(МассивВложенийСписком) Цикл
			        ТекущееВложение = СтрПолучитьСтроку(МассивВложенийСписком, Индекс); 
					если ТекущееВложение<>"" тогда
						МассивВложений.Добавить(СокрЛП(ТекущееВложение)); 
					КонецЕсли;
				КонецЦикла; 
				
				
				
				если Мстр.Важность = "Высокая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
	иначеесли Мстр.Важность = "Наивысшая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Наивысшая;
	иначеесли Мстр.Важность = "Наименьшая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Наименьшая;
	иначеесли Мстр.Важность = "Низкая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Низкая;
	иначе
		Важность = ВажностьИнтернетПочтовогоСообщения.Обычная; 
	КонецЕсли;

	
	
				ПочтовыйМодуль.ОтправитьПисьмо(Мстр.УчетнаяЗапись, Мстр.Тема, Мстр.Тело, МассивВложений, Мстр.ИмяОтправителя, Мстр.МассивПолучателей, Мстр.УведомитьОДоставке, Мстр.МассивСкрытыхПолучателей, Мстр.УведомитьОПрочтении, Важность,,);
		КонецЦикла; 

		
	КонецПроцедуры
